package stats

import "fmt"

type NatureModifier struct {
	H, A, B, C, D, S float64
}

var natureModifiers = map[string]NatureModifier{
	// 補正なし
	"がんばりや": {1, 1, 1, 1, 1, 1},
	"すなお":   {1, 1, 1, 1, 1, 1},
	"てれや":   {1, 1, 1, 1, 1, 1},
	"きまぐれ":  {1, 1, 1, 1, 1, 1},
	"まじめ":   {1, 1, 1, 1, 1, 1},
	// A上昇
	"さみしがり": {1, 1.1, 0.9, 1, 1, 1},
	"いじっぱり": {1, 1.1, 1, 0.9, 1, 1},
	"やんちゃ":  {1, 1.1, 1, 1, 0.9, 1},
	"ゆうかん":  {1, 1.1, 1, 1, 1, 0.9},
	// B上昇
	"ずぶとい":  {1, 0.9, 1.1, 1, 1, 1},
	"わんぱく":  {1, 1, 1.1, 0.9, 1, 1},
	"のうてんき": {1, 1, 1.1, 1, 0.9, 1},
	"のんき":   {1, 1, 1.1, 1, 1, 0.9},
	// C上昇
	"ひかえめ":  {1, 0.9, 1, 1.1, 1, 1},
	"おっとり":  {1, 1, 0.9, 1.1, 1, 1},
	"うっかりや": {1, 1, 1, 1.1, 0.9, 1},
	"れいせい":  {1, 1, 1, 1.1, 1, 0.9},
	// D上昇
	"おだやか":  {1, 0.9, 1, 1, 1.1, 1},
	"おとなしい": {1, 1, 0.9, 1, 1.1, 1},
	"しんちょう": {1, 1, 1, 0.9, 1.1, 1},
	"なまいき":  {1, 1, 1, 1, 1.1, 0.9},
	// S上昇
	"おくびょう": {1, 0.9, 1, 1, 1, 1.1},
	"せっかち":  {1, 1, 0.9, 1, 1, 1.1},
	"ようき":   {1, 1, 1, 0.9, 1, 1.1},
	"むじゃき":  {1, 1, 1, 1, 0.9, 1.1},
}

func GetNatureModifiers(name string) (NatureModifier, error) {
	if nature, ok := natureModifiers[name]; ok {
		return nature, nil
	}

	return NatureModifier{}, fmt.Errorf("unknown nature: %s", name)
}
